# Задача 22. Задайте список из нескольких чисел. Напишите программу, которая
# найдет сумму элементов списка, стоящих на нечетной позиции.

# Пример:
# [2, 3, 5, 9, 3] -> на нечетных позициях элементы 3 и 9, ответ: 12.

list = [2, 3, 5, 9, 3]
print(list)
sum = 0

for i in range(1, len(list), 2):
    sum += list[i]
print(sum)

# Задача 23. Напишите программу, которая найдет произведение пар чисел списка. Парой считаем
# первый и последний элемент, второй и предпоследний и т.д.

# Пример:
#  - [2, 3, 4, 5, 6] => [12, 15, 16]
#  - [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6]
list1 = []
if len(list) % 2 == 0:
    for i in range(0, int(len(list)/2)):
        list1.append(list[i] * list[-i-1])
else:
    for i in range(0, int(len(list)/2+1)):
        list1.append(list[i] * list[-i-1])
print(list1) 

# Задача 24. Задайте список из вещественных чисел. Напишите программу, которая найдет разницу
# между максимальным и минимальным значением дробной части элементов.
# Пример:
# [1.1, 1.2, 3.1, 5, 10.01] => 0.19

numbers = [1.1, 1.2, 3.1, 5, 10.01]
numbers1 =[]

for i in range(0, len(numbers)):
    if type(numbers[i]) == float:
       numbers1.append(round((numbers[i]%1), 2))

min = numbers1[0] % 1
max = numbers1[0] % 1

for i in range(1, len(numbers1)):
    if numbers1[i]%1 > max:
        max = numbers1[i] % 1
    elif numbers1[i] % 1 < min:
        min = numbers1[i] % 1

print(round(max - min, 2))


# Задача 25. Напишите программу, которая будет преобразовывать
# десятичное число в двоичное.

# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

n = int(input())
b = ''

while n > 0:
    b = str(n % 2) + b
    n = n // 2
print(b)